БухЭксп/InformationRegisters/АутентификацияПользователяПИоТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АутентификацияПользователяПИоТ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВременнаяМетка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КассирИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Успешность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодключаемоеОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСобытия</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/АутентификацияПользователяПИоТ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.УправлениеДоступом
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
//
// Параметры:
//  Ограничение - Структура:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                          Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                          Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                          если Истина, тогда не записывать ключи доступа,
//                                          а использовать ключи доступа владельца (требуется,
//                                          чтобы ограничение было строго по объекту-владельцу).
//   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - также
//                                          как у параметра ПоВладельцуБезЗаписиКлючейДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Менеджер = "РегистрСведений.АутентификацияПользователяПИоТ";
	МенеджерОборудованияВызовСервераПереопределяемый.ПриЗаполненииОграниченияДоступа(Менеджер, Ограничение);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Записать аутентификацию пользователя ПИоТ регистр
// 
// Параметры:
//  ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование -
//  ПараметрыАутентификации - Структура -
//
Процедура ЗаписатьАутентификациюПользователяПИоТ(ПодключаемоеОборудование, ПараметрыАутентификации) Экспорт
	
	Если Не ЗначениеЗаполнено(ПодключаемоеОборудование) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(ПодключаемоеОборудование) Тогда
		Возврат;
	КонецЕсли;          
	
	МенеджерЗаписи = СоздатьНаборЗаписей();
	Запись = МенеджерЗаписи.Добавить();       
	Запись.ПодключаемоеОборудование = ПодключаемоеОборудование; 
	Запись.ИдентификаторСобытия = Новый УникальныйИдентификатор();   
	Запись.ВременнаяМетка = ПараметрыАутентификации.ВременнаяМетка;
	Запись.Кассир = ПараметрыАутентификации.Кассир;
	Запись.КассирИНН = ПараметрыАутентификации.КассирИНН;
	Запись.Успешность = ПараметрыАутентификации.Успешность;
	МенеджерЗаписи.Записать(Ложь);          
	
КонецПроцедуры            

Функция ЗаписиАутентификацииПользователяПИоТ(ПодключаемоеОборудование) Экспорт
	
	ДанныеАутентификации = Новый Массив();
	
	Если Не ЗначениеЗаполнено(ПодключаемоеОборудование) Тогда
		Возврат ДанныеАутентификации;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);              
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АутентификацияПользователяПИоТ.ВременнаяМетка КАК ВременнаяМетка,
		|	АутентификацияПользователяПИоТ.Кассир КАК Кассир,
		|	АутентификацияПользователяПИоТ.КассирИНН КАК КассирИНН,    
		|	АутентификацияПользователяПИоТ.Успешность КАК Успешность    
		|ИЗ
		|	РегистрСведений.АутентификацияПользователяПИоТ КАК АутентификацияПользователяПИоТ
		|ГДЕ
		|	АутентификацияПользователяПИоТ.ПодключаемоеОборудование = &Оборудование
		|УПОРЯДОЧИТЬ ПО ВременнаяМетка";
	
	Запрос.УстановитьПараметр("Оборудование", ПодключаемоеОборудование);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл       
		Аутентификации = Новый Структура();
		Аутентификации.Вставить("ВременнаяМетка", Выборка.ВременнаяМетка);
		Аутентификации.Вставить("Кассир"       , Выборка.Кассир);
		Аутентификации.Вставить("КассирИНН"    , Выборка.КассирИНН);
		Аутентификации.Вставить("Успешность"   , Выборка.Успешность);
		ДанныеАутентификации.Добавить(Аутентификации);
	КонецЦикла;
	
	Возврат ДанныеАутентификации;
	
КонецФункции

// Очищает cобытия эксплуатации ТС ПИоТ для указанного подключаемого оборудования.
//
// Параметры:
//   ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование - 
//     ссылка на подключаемое оборудование, для которого необходимо очистить архив логов
//
Процедура ОчиститьАутентификацииПользователяПИоТ(ПодключаемоеОборудование) Экспорт
	
	Если Не ЗначениеЗаполнено(ПодключаемоеОборудование) Тогда
		ВызватьИсключение НСтр("ru = 'Не указано подключаемое оборудование.'");
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.ПодключаемоеОборудование.Установить(ПодключаемоеОборудование); 
	Набор.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
